<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use DB;
use Carbon\Carbon;
use App\Models\Country;
use App\Models\City;

class CountrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $countries = [
            [
                "name" => 'المغرب',
                "cities" => ['الدار البيضاء', 'الرباط', 'فاس', 'مراكش', 'طنجة', 'أكادير', 'مكناس', 'ولاية العيون', 'الحسيمة', 'بني ملال', 'وجدة', 'الجديدة', 'تطوان', 'المحمية', 'خريبكة', 'تمارة', 'القنيطرة', 'الناظور', 'العرائش', 'تاونات', 'سلا', 'الفقيه بن صالح', 'بركان', 'الجديدة', 'اليوسفية', 'العرائش', 'خنيفرة', 'تازة', 'المضيق', 'أزمور', 'تارودانت', 'ورزازات', 'زاكورة', 'الخميسات', 'تزنيت', 'تاوريرت', 'القصر الكبير', 'تاهلة', 'الرشيدية', 'سيدي سليمان', 'تاوجطات', 'إفران', 'كلميم', 'وزان', 'سيدي قاسم', 'سيدي بنور'],
            ],[
                "name" => 'مصر',
                "cities" => [ 'القاهرة', 'الإسكندرية', 'الجيزة', 'المنصورة', 'الزقازيق', 'الفيوم', 'طنطا', 'المحلة الكبرى', 'أسيوط', 'سوهاج', 'قنا', 'بني سويف', 'الفayoum', 'الإسماعيلية', 'المنيا', 'العريش', 'أسوان', 'دمياط', 'المنوفية', 'بورسعيد', 'السويس', 'كفر الشيخ', 'مرسى مطروح', 'شرم الشيخ', 'الغردقة', 'العلمين', 'المنيا الجديدة', 'رأس البر', 'رأس غارب', 'بورفؤاد', 'دمنهور', 'بلطيم', 'المحمودية', 'بنها', 'قليوب', 'طلخا', 'مدينة العبور', 'دمنهور', 'شبين الكوم', 'أخميم', 'مدينة نصر', 'المطرية', 'الشروق', 'حلوان', 'المعادي'],
            ],[
                "name" => 'البحرين',
                "cities" => ['المنامة', 'الرفاع', 'المحرق', 'عيسى', 'الحد', 'جدحفص', 'المالكية', 'الحلة', 'البديع', 'الدراز', 'العدلية', 'الجفير', 'الحدائق', 'النعيم', 'المشرف', 'الحورة', 'القلعة', 'السلمانية', 'الديه', 'عسكر', 'الجسر', 'مدينة عيسى'],
            ],[
                "name" => 'الجزائر',
                "cities" => ['الجزائر العاصمة', 'العنابة', 'وهران', 'قسنطينة', 'باتنة', 'سطيف', 'تلمسان', 'تيبازة', 'البليدة', 'بجاية', 'عنابة', 'قسنطينة', 'الجلفة', 'سعيدة', 'تيزي وزو', 'بسكرة', 'بشار', 'غليزان', 'المدية', 'تبسة', 'سكيكدة', 'عين تموشنت', 'مستغانم', 'تيارت', 'تمنراست', 'تيارت', 'ورقلة', 'بومرداس', 'عين الدفلى', 'قالمة', 'الأغواط', 'ميلة', 'قالمة', 'بورج بوعريريج', 'الطارف', 'المسيلة', 'سوق أهراس', 'معسكر', 'الوادي', 'البيض', 'إليزي', 'جيجل', 'النعامة', 'تندوف', 'تيسمسيلت', 'أدرار', 'الأغواط', 'برج بوعريريج', 'بومرداس'],
            ],[
                "name" => 'تونس',
                "cities" => ['تونس العاصمة', 'صفاقس', 'سوسة', 'قفصة', 'قابس', 'القيروان', 'بنزرت', 'نابل', 'زغوان', 'مدنين', 'تطاوين', 'المنستير', 'جندوبة', 'الكاف', 'سيدي بوزيد', 'توزر', 'باجة', 'بن عروس', 'منوبة', 'أريانة', 'المهدية', 'قبلي', 'القصرين', 'تونس الكبرى'],
            ],[
                "name" => 'الإمارات العربية المتحدة',
                "cities" => ['دبي', 'أبو ظبي', 'الشارقة', 'عجمان', 'رأس الخيمة', 'أم القيوين', 'الفجيرة', 'خورفكان', 'دبا الحصن', 'دبا الفجيرة', 'مرفأ خليفة', 'العين', 'حتا', 'كلباء', 'مدينة محمد بن راشد', 'مدينة خليفة', 'مدينة جميرا', 'مدينة محمد بن زايد', 'مدينة العين', 'مدينة الفجيرة', 'مدينة خورفكان', 'مدينة أبوظبي', 'مدينة الشارقة', 'مدينة دبي', 'مدينة عجمان', 'مدينة رأس الخيمة', 'مدينة أم القيوين', 'مدينة مسقط', 'مدينة زاهد', 'مدينة صور', 'مدينة نزوى'],
            ],
            [
                "name" => 'اليمن',
                "cities" => ['صنعاء', 'عدن', 'تعز', 'الحديدة', 'إب', 'المكلا', 'ذمار', 'البيضاء', 'سيئون', 'حضرموت', 'رداع', 'الحديبة', 'المخا', 'التواهي', 'عمران', 'الجراحي', 'زبيد', 'الحوطة', 'الغيضة', 'البريقة', 'الصافية', 'مأرب', 'سئون', 'مرخة', 'الضالع', 'الظالع', 'الجوف', 'صعدة', 'المهرة', 'الجوف', 'المهرة', 'حجة', 'الحديدة', 'ريمة', 'شبوة', 'الضالع', 'البيضاء'],
            ],
            [
                "name" => 'جيبوتي',
                "cities" => ['جيبوتي', 'أوبوك', 'تاجورة', 'عرتيل', 'دبوا', 'ديخل', 'دورايلى', 'مونة', 'أرتا', 'غاليلي', 'لويا'],
            ],
            [
                "name" => 'ليبيا',
                "cities" => ['طرابلس', 'بنغازي', 'مصراتة', 'سرت', 'الزاوية', 'درنة', 'البيضاء', 'ترهونة', 'زوارة', 'أوباري', 'سبها', 'مرزق', 'زليتن', 'الخمس', 'المرج', 'سلوق', 'العجيلات', 'الأجيلات', 'الزنتان', 'تاجوراء', 'الزوية', 'الماية', 'العطشانة', 'العوينات', 'أوجلة', 'بني وليد', 'براك', 'البراك', 'بن جواد', 'بيت المال', 'بوزيان', 'بوسليم', 'البوصيري', 'تاجورة', 'ترهونة', 'الجميل', 'جادو', 'جالو', 'غات', 'الغرفة', 'غدامس', 'الفويهات', 'فرناج', 'الكفرة', 'كيش', 'قصر الأخيارف', 'قصر العقيلة', 'ليبيا', 'مطروح', 'مصراته', 'المرج', 'مرسى البراك', 'المنصورة', 'مرزق', 'نالوت', 'نالوت', 'نوفليين', 'وادي الشاطئ', 'وادي الحيض', 'وادي عتبة', 'والجة', 'واو', 'الزنتان'],
            ],[
                "name" => 'عمان',
                "cities" => ['مسقط', 'صلالة', 'صحار', 'نزوى', 'كهبة', 'بركاء', 'السيب', 'الخابورة', 'البريمي', 'العوابي', 'الرستاق', 'صور', 'شناص', 'ظفار', 'جعلان بني بو حسن', 'المصنعة', 'الهماء', 'ينقل', 'بهلاء', 'وادي بني خالد', 'الدقم', 'بوشر'],
            ], [
                "name" => 'قطر',
                "cities" => ['الدوحة', 'الوكرة', 'الريان', 'الخور', 'الزخرف', 'الخور', 'الشحانية', 'الوكرة', 'الشمال', 'الغرب', 'الدخيل', 'أم صلال', 'الخريطيات', 'الوكرة', 'الجميلية', 'أزغوى', 'الداعية', 'الجليعة', 'الريان', 'المسيلة'],
            ], [
                "name" => 'السعودية',
                "cities" => ['الرياض', 'جدة', 'مكة المكرمة', 'المدينة المنورة', 'بريدة', 'تبوك', 'خميس مشيط', 'حائل', 'الطائف', 'القطيف', 'خبر', 'جازان', 'نجران', 'الخرج', 'أبها', 'ينبع', 'الجبيل', 'الدمام', 'عرعر', 'الحفر', 'الرس'],
            ], [
                "name" => 'العراق',
                "cities" => ['بغداد', 'البصرة', 'الموصل', 'السليمانية', 'أربيل', 'كربلاء', 'النجف', 'الديوانية', 'الحلة', 'كركوك', 'ديالى', 'واسط', 'الأنبار', 'صلاح الدين', 'دهوك', 'ميسان', 'نينوى', 'ذي قار', 'بابل', 'كرمانشاه', 'السماوة'],
            ], [
                "name" => 'الأردن',
                "cities" => ['عمان', 'الزرقاء', 'إربد', 'العقبة', 'مادبا', 'السلط', 'المفرق', 'جرش', 'عجلون', 'الكرك', 'معان', 'الطفيلة', 'الرمثا', 'البلقاء', 'الكرامة', 'الحصن', 'القويسمة', 'الرصيفة', 'دير علا', 'كفرنجة'],
            ], [
                "name" => 'فلسطين',
                "cities" => ['القدس', 'غزة', 'رام الله', 'نابلس', 'خان يونس', 'الخليل', 'جنين', 'طولكرم', 'بيت لحم', 'رفح', 'بيت حانون', 'البريج', 'بيت جالا', 'سلفيت', 'الظاهرية', 'دير البلح', 'السموع', 'الفارعة', 'عبسان الكبيرة', 'جباليا'],
            ], [
                "name" => 'الكويت',
                "cities" => ['الكويت', 'الأحمدي', 'الفروانية', 'حولي', 'مبارك الكبير', 'الجهراء', 'العاصمة', 'الصليبية', 'الوفرة', 'القصور', 'السالمية', 'الرقة', 'العديلية', 'النعيم', 'العدان', 'الشعب', 'المنقف', 'الرميثية', 'المهبولة', 'القرين'],
            ], [
                "name" => 'لبنان',
                "cities" => ['بيروت', 'طرابلس', 'جبيل', 'صيدا', 'صور', 'زحلة', 'النبطية', 'بعلبك', 'البترون', 'عكار', 'المتن', 'الشوف', 'الكورة', 'بعبدا', 'الضنية', 'البقاع', 'بشري', 'عاليه', 'الشفاء', 'جزين'],
            ], [
                "name" => 'موريتانيا',
                "cities" => ['نواكشوط', 'نواذيبو', 'كيهيدي', 'روصو', 'أطار', 'تجكجة', 'الزويرات', 'النعمة', 'بوكيه', 'أكجوجت', 'كيفه', 'سيلبابي', 'كرمسين', 'بوتلميت', 'لعيون', 'تفرغ زينة', 'باسكنو', 'جكني', 'بومديد', 'الرشيد'],
            ], [
                "name" => 'السودان',
                "cities" => ['الخرطوم', 'أم درمان', 'بحري', 'الجزيرة', 'كسلا', 'النيل الأزرق', 'شمال كردفان', 'جنوب كردفان', 'الوحدة', 'البحر الأحمر', 'سنار', 'كسلا', 'النيل الأبيض', 'غرب كردفان', 'شمال دارفور', 'جنوب دارفور', 'غرب دارفور', 'شمال كردفان', 'جنوب كردفان', 'شرق كردفان'],
            ], [
                "name" => 'سوريا',
                "cities" => ['دمشق', 'حلب', 'حمص', 'حماة', 'اللاذقية', 'ادلب', 'درعا', 'القنيطرة', 'السويداء', 'طرطوس', 'الحسكة', 'دير الزور', 'الرقة', 'السلمية', 'مصياف', 'صلنفة', 'التل', 'الرستن', 'المالكية', 'الباب'],
            ],
        ];

        $count = 1;
        foreach ($countries as $country) {
            $countryName = $country['name'];
            $countryCities = $country['cities'];

            Country::create([
                'name' => $countryName
            ]);

            $countPlusOne = $count++;
            foreach ($countryCities as $city) {
                City::create([
                    'name' => $city,
                    'country' => $countPlusOne
                ]);
            }
        }
    }
}
